//*****************************************************
//
// 塵の管理[dustmanager.cpp]
// Author:髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "dustmanager.h"
#include "dust.h"

//*****************************************************
// マクロ定義
//*****************************************************
#define MAX_FIELD	(15000)	// フィールドの広さ

//=====================================================
// コンストラクタ
//=====================================================
CDustManager::CDustManager()
{

}

//=====================================================
// デストラクタ
//=====================================================
CDustManager::~CDustManager()
{

}

//=====================================================
// 初期化処理
//=====================================================
HRESULT CDustManager::Init(void)
{
	return S_OK;
}

//=====================================================
// 終了処理
//=====================================================
void CDustManager::Uninit(void)
{
	Release();
}

//=====================================================
// 更新処理
//=====================================================
void CDustManager::Update(void)
{
	m_nTimer--;

	if (m_nTimer <= 0)
	{
		D3DXVECTOR3 pos = { 0.0f,0.0f,0.0f };

		// ランダムな地点を決定
		pos.x = (rand() % MAX_FIELD) - MAX_FIELD * 0.5f;
		pos.z = (rand() % MAX_FIELD) - MAX_FIELD * 0.5f;

		// エリアのランダムな地点に塵を発生させる
		CDust::Create(pos);

		// タイマー再設定
		SetTimer();
	}
}

//=====================================================
// タイマーの再設定
//=====================================================
void CDustManager::SetTimer(void)
{
	m_nTimer = rand() % 3 + 3;
}

//=====================================================
// 描画処理
//=====================================================
void CDustManager::Draw(void)
{

}

//=====================================================
// 生成処理
//=====================================================
CDustManager *CDustManager::Create(void)
{
	CDustManager *pDustManager = nullptr;

	if (pDustManager == nullptr)
	{// インスタンス生成
		pDustManager = new CDustManager;

		// 初期化処理
		pDustManager->Init();
	}

	return pDustManager;
}