//*****************************************************
//
// エディターの処理[edit.h]
// Author:髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "main.h"
#include "block.h"

//*****************************************************
// 前方宣言
//*****************************************************
class CObjectX;

//*****************************************************
// クラスの定義
//*****************************************************
class CEdit
{
public:
	CEdit();	// コンストラクタ
	~CEdit();	// デストラクタ
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

private:
	void Load(void);	// ブロックの番号を取得する処理

	CObjectX *m_pObjectCursor;	// カーソルのオブジェクトXへのポインタ
	int m_nIdxObject;
	CBlock::TYPE m_type;
};